IDENTIFICATION DIVISION.
PROGRAM-ID. CEASER-CIPHER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-STRING PIC X(20).
01 CIPHER-STRING PIC X(20).
01 SHIFT-AMOUNT PIC 9(2).

PROCEDURE DIVISION.
DISPLAY 'Enter a string: '.
ACCEPT INPUT-STRING.

DISPLAY 'Enter shift amount: '.
ACCEPT SHIFT-AMOUNT.

DISPLAY 'You entered: ' INPUT-STRING.

STOP RUN.
END-PROGRAM.