IDENTIFICATION DIVISION.
PROGRAM-ID. CEASER-CIPHER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-STRING PIC X(20).
01 CIPHER-STRING PIC X(20).
01 SHIFT-AMOUNT PIC 9(2).
01 COUNTER PIC 9(2) VALUE 0.

PROCEDURE DIVISION.
DISPLAY 'SIMMYZ CM ECHA'.
ACCEPT INPUT-STRING.

DISPLAY 'YOUSSEF IS KING: '.
ACCEPT SHIFT-AMOUNT.
PERFORM UNTIL COUNTER = 10
   ADD 1 TO COUNTER
   DISPLAY "Ceaser: " COUNTER, 
END-PERFORM.
DISPLAY 'You entered: ' INPUT-STRING.

STOP RUN.
END-PROGRAM.